docs/draft/design.tex

\subsubsection{Diacritic placements that make sense}
\label{sec:org6749514}

Since diacritics don't have phonetic value or any transcription equivalencies most of the time, finding memorable places for them relies much more on visual correspondences and raw optimality. The visual correspondences here are a little less obvious as well (e.g., : yields a diaeresis as apposed to a yields α).

This is one of the key areas that this project distinguishes itself from others. Many (but not all) keyboard layouts for languages like Greek and Hebrew use either dead-keys or complicated chords (Ctrl + Alt/Option + something) to enter diacritics, which is far harder to remember than a single key equivalence, particularly a key equivalence with visual correspondence. Single keys (even those that require shift to enter) are also much faster to type in general.

As with letters, visual correspondences are prioritized above raw optimality, following the same hypothesis that memorability is of greater concern for the keyboard layouts of non-native languages than theoretical measures of efficiency.

\subsection{Customizability as a first order priority}
\label{sec:orgf37a9ba}

\begin{itemize}
\item Thorough API
\item In-line comments
\item Examples in the form of Greek and Hebrew layers
\end{itemize}

\subsection{Minimal interference with normal computer use}
\label{sec:orgb27dc69}

\begin{itemize}
\item Quick and easy on and off
\item Consistent keyboard shortcuts (languages do not interfere with normal shortcuts)
\item Leader-prefixed punctuation for normal behavior (for when punctuation gets hijacked by a layer for diacritics and so forth)
\end{itemize}

\subsection{Consistency across multiple languages}
\label{sec:org9ba8e6e}

\subsubsection{For end users}
\label{sec:org31fa87b}

\begin{itemize}
\item Base markup for Latin, German, French, Italian, Spanish. Leader-prefixed diacritics.
\item Switching between different alphabets; using different alphabets
\end{itemize}

\subsubsection{For designers}
\label{sec:org7399818}

\begin{itemize}
\item Consistent handling of precomposed and decomposed Unicode
\item Abstracted, language-blind functions to extend to new languages with minimal effort
\item If you understand how to code a layer for one language, you should be able to code layers for other different languages.
\end{itemize}

\section{Section 4: Greek as an example}
\label{sec:org67e82c9}
