docs/draft/design.tex

\subsection{Letters}
\label{sec:orgbcde056}

\subsubsection{A Greek-English keymap}
\label{sec:orgf437890}

\noindent \textbf{Foreword \{Todo: footnote this/put in appendix\}} \\

I have attempted to make the above discussion general enough that people with native languages significantly different than English (Russian, say) may easily transfer these ideas into layouts that fit their languages. However, from this point forward, discussion will center around English and languages that have a close association with it (the same general alphabet and phonology). \\

\noindent \textbf{Phonetic correspondences} \\

I have opted to supply the fricative versions of Theta and Phi, according to later developments in the language. People interested in classical 5th century Attic pronunciations can substitute the aspirated plosives if they wish. (I have made this substitution because I have observed that most people learning ancient Greek have a much easier time distinguishing the phonemes this way, and thus avoid mixing up Theta/Tau and Phi/Pi in their writing). \{Todo: don't be arbitrary. Explain, don't assume\}

If a letter has any English equivalent (even if it has additional sounds in some contexts not found in English), I have opted to match them. I have also opted to match "near misses" -- sounds that aren't quite identical, but are close enough that they are obviously connected (such as the Greek Rho and English R, and many of the vowels). \{Todo: handle cases of similar sounds like o/w e/h, etc. Also weighting phonetic correspondence vs. frequency/visual correspondence as with digamma and omega\}

\begin{center}
\begin{tabular}{lll}
Greek letter & IPA & English match\\
\hline
Α α & [a], [aː] & A\\
Β β & [b] & B\\
Γ γ & [g], [ŋ] (before velars) & G\\
Δ δ & [d] & D\\
Ε ε & [e] & E\\
Ζ ζ & [zd] & Z\\
Η η & [ɛː] & \\
Θ θ & [θ] & \\
Ι ι & [i], [iː] & I\\
Κ κ & [k] & K\\
Λ λ & [l] & L\\
Μ μ & [m] & M\\
Ν ν & [n] & N\\
Ξ ξ & [ks] & X\\
Ο ο & [o] & O\\
Π π & [p] & P\\
Ρ ρ & [r] & R\\
Σ σ & [s] & S\\
Τ τ & [t] & T\\
Υ υ & [y], [yː] & U\\
Φ φ & [f] & F\\
Χ χ & [kʰ] & \\
Ψ ψ & [ps] & \\
Ω ω & [ɔː] & \\
\end{tabular}
\end{center}

This "first pass" at matching gets us pretty far - only 5 letters remain unmatched. \\

\noindent \textbf{Visual correspondences} \\

Look-alike letters, even if they have no phonetic correspondence, can be an easy way to remember letters. Anything that helps create mental associations can help speed up the learning process. Both uppercase and lowercase forms are considered.

\begin{center}
\begin{tabular}{ll}
Greek letter & English match\\
\hline
Η η & H\\
Θ θ & \\
Χ χ & \\
Ψ ψ & Y\\
Ω ω & w\\
\end{tabular}
\end{center}

Uppercase Eta looks identical to the uppercase form of the English letter H, and lowercase Omega looks very similar to the lowercase form of the English letter W. Uppercase Psi looks similar enough to the uppercase form of the English letter Y that it is worth using as a mnemonic, in my opinion.

Note that while Chi looks very similar to the English letter X, we are already using X to represent Xi. \\

\noindent \textbf{Transcription correspondences} \\

One of the problems with transcription is that it is not terribly standardized. For example, scholars preferring a transcription scheme closer to Greek will typically transliterate Kappa as "k" and chi as "kh" as opposed to the more Romanized "c" and "ch." However, "typical" transcriptions may provide some help in providing mnemonics for our remaining letters.

I have opted to only look at strictly alphabetical transcriptions, rather than any that use diacritics. \{Todo: why?\}

\begin{center}
\begin{tabular}{lll}
Greek letter & "Typical" transcription & English match\\
\hline
Θ θ & th & \\
Χ χ & ch & C\\
\end{tabular}
\end{center}

Chi is transliterated as "ch" in most transcription schemes, even if Kappa is transliterated as "k." So it seems logical to use the letter C to represent chi. \\

\noindent \textbf{Leftovers} \\

Theta is a tricky letter to place, since none of our correspondence efforts appear to help with it. English letters that are left include Q, V, and J.

None of these letters is particularly satisfying as a choice, but J is probably the best for people that type on QWERTY or its variants (like AZERTY, e.g.), since it is on the home row and does not have any same finger with vowels. For this reason, I have made it the default mapping for theta. People that do not type on QWERTY (Dvorak, Colemak, Workman, etc.) may want to alter this location, depending. I type on a custom layout and kept it on J because it was still the best location.

As to Q and V, I have these default to Koppa and Digamma, respectively. Both of these come from earlier forms of Greek that are closer to the Phoenician, but may be useful to type on occasion. For people that read on for the Hebrew keymap, Koppa\textasciitilde{}Quf and Digamma\textasciitilde{}Vav, so Q and V are actually logical choices given the Semitic consonants underlying these letters.

Digamma dropping explains the -ευς declension and the development of certain stems and words. For example, βασιληϝ- to Βασιλεύς, νηϝ- to ναῦς, βοϝ- to βοῦς, and so on.

Koppa can be also be useful in explaining language development, as can the third and last early Greek letter: San (allophonic with Sigma). \{Todo: explain how to generate San\}

\subsection{Context-specific/alternate letter forms}
\label{sec:org5a94332}

\subsubsection{Final sigma}
\label{sec:orgea969f1}

\subsubsection{Lunate sigma}
\label{sec:org2bf0e2f}

\subsection{Mandatory markup}
\label{sec:org9814acc}

\subsubsection{Breathings}
\label{sec:orgc4b27f2}
`
\begin{itemize}
\item smooth, rough
\item vowels and rho
\end{itemize}

\subsubsection{Accents}
\label{sec:orgbc6bce2}

\begin{itemize}
\item acute, grave, circumflex
\end{itemize}

\subsubsection{Iota subscripts}
\label{sec:orgd87e673}

\subsubsection{Diaeresis}
\label{sec:orgcf76552}

\subsubsection{The koronis}
\label{sec:org63c8b4c}

\subsection{Additional markup}
\label{sec:org2d9e4cc}

\subsubsection{Vowel quantity: macrons and breves}
\label{sec:orge630e42}

\subsubsection{The underdot}
\label{sec:orge7ea1a4}

\subsection{Punctuation; language-specific symbols}
\label{sec:org34d2a8d}

\subsubsection{Question marks and semicolons}
\label{sec:org15a648d}

\subsubsection{A discussion of "hybrid" punctuation, and accessing normal punctuation when desired}
\label{sec:org23eb32e}

\{Todo: \footnote{Metrical marks, special numerals, drachma symbol}\}

\section{Section 5: Hebrew as an example}
\label{sec:org9aa0de8}

\subsection{Letters}
\label{sec:orgec074cb}

\subsubsection{Handling cases of identical letter sounds}
\label{sec:org9749e31}

\subsubsection{A Hebrew-English keymap}
\label{sec:org9c44e67}

\subsection{Context-specific/alternate letter forms}
\label{sec:orgf6a8f3a}

\subsubsection{Word final letters: the sofit forms}
\label{sec:org192c089}

\subsubsection{The Begadkephat letters}
\label{sec:org727da27}

\subsubsection{Shin and Sin}
\label{sec:orgcda071c}

\subsection{Mandatory markup}
\label{sec:orgf3c653e}

\subsubsection{A note about opinionated design decisions}
\label{sec:orgae38dc4}

\begin{itemize}
\item "Case study" -- the \emph{matres lectionis} letters. Automatically including vav and yod when they are vowel indicators.
\end{itemize}

\subsubsection{Basic vowel points}
\label{sec:org10e27bb}

\subsubsection{Shva and reduced vowels}
\label{sec:orgf531ef1}

\subsubsection{The dagesh}
\label{sec:org721eeb1}

\subsection{Additional markup}
\label{sec:org04850f5}

\subsubsection{The meteg}
\label{sec:org6d10fe8}

\subsubsection{Cantillation marks}
\label{sec:org3de1e33}

\subsection{Punctuation; language-specific symbols}
\label{sec:orga10fe7a}

\subsubsection{A discussion of languages that use "mostly normal" punctuation (from the English point of view)}
\label{sec:orgb61e54b}

\subsubsection{The geresh}
\label{sec:orge0bd250}

\subsubsection{The gershayim (lit. "double geresh" -- this word is plural)}
\label{sec:org95c4f8c}

\subsubsection{Colon and \emph{sof pasuq}}
\label{sec:orga617381}
