docs/draft/design.tex

\subsubsection{Vertical bar and \emph{paseq}}
\label{sec:org0816df1}

\subsubsection{Hyphen and \emph{maqaf}}
\label{sec:org3b22dd5}

\subsubsection{Shekel symbol}
\label{sec:orga247dfe}

\section{Section 6: Efficient typing practice for non-native languages}
\label{sec:org000f848}

\subsection{Introduction to efficient typing}
\label{sec:org9934075}

\subsubsection{Practicing based on word frequency}
\label{sec:org05de88b}

\subsubsection{Practicing based on N-gram frequency; affixes}
\label{sec:org2d6f5e7}

\begin{itemize}
\item (Derivational) Morphemes rather than words as a training focus
\end{itemize}

\subsubsection{Abbreviating very frequent words and phrases}
\label{sec:org1369820}

\subsubsection{Practicing the sorts of texts you are going to type}
\label{sec:orgeb85469}

\subsection{Creating necessary resources}
\label{sec:org51ca603}

\subsubsection{Word frequency tables}
\label{sec:org6310d1a}

\begin{itemize}
\item Perseus, TLG, handling overlapping forms
\end{itemize}

\subsubsection{N-gram frequency tables}
\label{sec:org733a026}

\begin{itemize}
\item Similar process. Handling semantic boundaries in regexes? How to automate morphological analysis without obvious delimiters like spaces for words?
\end{itemize}

\subsubsection{Area-specific practice texts}
\label{sec:org432c907}

\begin{itemize}
\item Downloading from free/uncopyrighted sources. Perseus, Project Gutenberg.\footnote{Automate with script? Probably also outside scope of project.}
\end{itemize}

\subsection{Typing practice}
\label{sec:org826dca8}

\subsubsection{Amphetype}
\label{sec:org4725d46}

\subsubsection{Lesson generation from frequency tables and practice texts}
\label{sec:org0c48eb2}

\subsection{Crossover benefits}
\label{sec:org0bed4ac}

\subsubsection{Vocabulary lists by frequency for specific domains}
\label{sec:org48dc35c}

\subsubsection{Morphological analysis and generative vocabulary}
\label{sec:orgcf6da76}

\begin{itemize}
\item Prefixes, suffixes, and roots. Developing an eye for picking up meanings automatically, simply by knowing what different parts of the word mean in general.
\end{itemize}

\section{Section 7: Pedagogical applications}
\label{sec:org07ad6fa}

\subsection{Orthography for digital natives}
\label{sec:orga6a410c}

\subsubsection{Standardization of letterforms}
\label{sec:orgdbc78af}

\begin{itemize}
\item Reducing the learning load in the first few weeks of Hebrew: block scripts and cursive scripts.
\item Possible in handwritten as well (just only writing in block)
\end{itemize}

\subsubsection{Typing speed and writing speed}
\label{sec:org1697c40}

\subsubsection{But the permanence of handwriting}
\label{sec:org54541e5}

\begin{itemize}
\item Tests
\end{itemize}

\subsection{Examples of typing-related pedagogical aids for Greek}
\label{sec:org7de17b4}

\subsubsection{Learning the accentuation system}
\label{sec:org518c79d}

\begin{itemize}
\item Practicing the typing of accents while learning about the rule of contonation, morae, and recessive accents.
\end{itemize}

\subsubsection{Common irregular verbs}
\label{sec:org7ad1cbd}

\begin{itemize}
\item Practicing the typing of certain very common irregular verbs (like \emph{eimi}, e.g.) while simultaneously learning their paradigms.
\end{itemize}

\subsubsection{Practicing reading/speaking Greek; "reading by typing"}
\label{sec:org6ce225e}

\begin{itemize}
\item Practicing typing in general by pulling in Greek texts from Perseus as typing training material. Students could be encouraged to also read the texts out loud as they type them. (Not necessarily understanding the Greek, but getting to see how it sounds and flows).
\end{itemize}

\section{Section 8: Concluding remarks}
\label{sec:org5b39812}

\subsection{Specific implementation benefits}
\label{sec:org7a96311}

\subsubsection{Who should make the switch to this system? Is this project really worthwhile?}
\label{sec:org2724fb2}

\subsubsection{The low opportunity cost for the next generation}
\label{sec:orgfa049c8}

\subsection{Moving forward with more languages}
\label{sec:orgd14e84e}

\subsubsection{Current project: focus on Greek with Hebrew as a foil}
\label{sec:orgaa207d3}

\subsubsection{Possibility to expand much further}
\label{sec:orgdcd002c}

\subsection{Suggestions for further research}
\label{sec:org7f80a60}

\subsubsection{Corpus generation}
\label{sec:org53e0c2c}

\subsubsection{Morphological analysis}
\label{sec:org1dfe176}

\subsubsection{Graphical frontends for customization}
\label{sec:org8c1d64e}

\subsubsection{System APIs for keystream manipulations \emph{across platforms}}
\label{sec:org3fa5e7b}

\subsubsection{AI autograders for language exercises}
\label{sec:orgccf2baa}

\section{Section 9: Appendix}
\label{sec:org951582c}

\subsection{Integrating general electronic/online resources into classes}
\label{sec:orge6351fd}

\subsubsection{Language input as a pain point}
\label{sec:org7c964e5}

\begin{itemize}
\item A lack of good keyboard input is a significant damper to the use of electronic/online resources.
\end{itemize}

\subsubsection{The value of electronic/online resources}
\label{sec:org446a640}

\noindent \textbf{Elecronic lexica and morphology parsers} \\

Dangers of over-reliance, but great benefits all the same. Arbitrary searches (those that require the ability to type native text) can be necessary when using paper sources rather than cross-linked sources like those on Perseus. \\

\noindent \textbf{Searches} \\

\begin{itemize}
\item Fuzzy search (i.e., lemma search), finding passages and references, searching on word usage or specific form.
\item Searching typed notes, if people type class notes \\
\end{itemize}

\noindent \textbf{Electronic flashcards} \\

More polarizing whether or not they are useful, but making them easier to construct is definitely a good thing. Spaced repetition studying, Anki. \\

\noindent \textbf{Autograded sentences} \\

\begin{itemize}
\item Practicing typing in general by providing form-fields to enter sentence translations. Depending on the difficulty of implementation, it might be possible to create an autograder for practice sentences in Athenaze, for example. If care was taken to follow vocabulary acquisition (so as to limit the lexicon input for the program and make it deterministic), it would be easy for professors to design supplemental/optional practice exercises that the students could complete with instant feedback and no extra work for the professor.
\end{itemize}

\subsection{Word Processing}
\label{sec:org01c20a0}

\subsubsection{Font testing: Gentium Plus + SBL Hebrew}
\label{sec:org8a108b8}

Here is some inline Hebrew from the beginning of Genesis 1 \texthebrew{‏בְּרֵאשִׁ֖ית בָּרָ֣א אֱלֹהִ֑ים אֵ֥ת הַשָּׁמַ֖יִם וְאֵ֥ת הָאָֽרֶץ׃ ‎2‏ וְהָאָ֗רֶץ הָיְתָ֥ה תֹ֨הוּ֙ וָבֹ֔הוּ וְחֹ֖שֶׁךְ עַל־פְּנֵ֣י תְה֑וֹם וְר֣וּחַ אֱלֹהִ֔ים מְרַחֶ֖פֶת עַל־פְּנֵ֥י הַמָּֽיִם׃ ‎3‏ וַיֹּ֥אמֶר אֱלֹהִ֖ים יְהִ֣י א֑וֹר וַֽיְהִי־אֽוֹר׃ ‎4‏ וַיַּ֧רְא אֱלֹהִ֛ים אֶת־הָא֖וֹר כִּי־ט֑וֹב וַיַּבְדֵּ֣ל אֱלֹהִ֔ים בֵּ֥ין הָא֖וֹר וּבֵ֥ין הַחֹֽשֶׁךְ׃} with English around it. And now a block:

\begin{quote}
\begin{hebrew}
‏‏בְּרֵאשִׁ֖ית בָּרָ֣א אֱלֹהִ֑ים אֵ֥ת הַשָּׁמַ֖יִם וְאֵ֥ת הָאָֽרֶץ׃ ‎2‏ וְהָאָ֗רֶץ הָיְתָ֥ה תֹ֨הוּ֙ וָבֹ֔הוּ וְחֹ֖שֶׁךְ עַל־פְּנֵ֣י תְה֑וֹם וְר֣וּחַ אֱלֹהִ֔ים מְרַחֶ֖פֶת עַל־פְּנֵ֥י הַמָּֽיִם׃ ‎3‏ וַיֹּ֥אמֶר אֱלֹהִ֖ים יְהִ֣י א֑וֹר וַֽיְהִי־אֽוֹר׃ ‎4‏ וַיַּ֧רְא אֱלֹהִ֛ים אֶת־הָא֖וֹר כִּי־ט֑וֹב וַיַּבְדֵּ֣ל אֱלֹהִ֔ים בֵּ֥ין הָא֖וֹר וּבֵ֥ין הַחֹֽשֶׁךְ׃
\end{hebrew}
\end{quote}

And here is some inline Greek from the \emph{Iliad} μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος with English around it. And now a longer chunk:

\begin{quote}
μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος οὐλομένην, ἣ μυρί᾽ Ἀχαιοῖς ἄλγε᾽ ἔθηκε, πολλὰς δ᾽ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν οἰωνοῖσί τε πᾶσι, Διὸς δ᾽ ἐτελείετο βουλή, ἐξ οὗ δὴ τὰ πρῶτα διαστήτην ἐρίσαντε Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ δῖος Ἀχιλλεύς. τίς τ᾽ ἄρ σφωε θεῶν ἔριδι ξυνέηκε μάχεσθαι;
\end{quote}

\subsubsection{Reasons why something other than Word might be desirable}
\label{sec:org6b1d37e}

\begin{itemize}
\item Automatic font use rather than manual switching
\end{itemize}

\subsubsection{Example: Emacs' Org mode to PDF using XeLaTeX}
\label{sec:org9f28cfa}

\begin{itemize}
\item Support for RTL languages and automatic display
\item Polyglossia
\item Automatic font switches
\end{itemize}

\subsubsection{Yudit?}
\label{sec:org0497442}

\{Todo: \footnote{Need to research more.}\}

\subsection{Abbreviations}
\label{sec:orgcb19b82}

\begin{itemize}
\item More of a personal thing. Can algorithmically generate in theory. (Outside scope of this project).
\item Probably good to look at the 10 or 15 most common words and see if anything jumps out at you
\item Creating regex hotstrings in this particular AHK implementation.
\end{itemize}
